# ColorEncoding Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCloudType..::..ColorEncoding Property
PointCloudType Class See Also
---
The color encoding used by points extracted from instances of this point cloud.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public PointCloudColorEncoding ColorEncoding { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ColorEncoding As PointCloudColorEncoding
	Get
```

Visual C++
---
```text
public:
property PointCloudColorEncoding ColorEncoding {
	PointCloudColorEncoding get ();
}
```

# See Also
PointCloudType Class
Autodesk.Revit.DB Namespace